In [ ]:
import sqlite3 as s

In [ ]:
conn = s.connect('test.db') #un pw  .db
print ("Opened database successfully");

Opened database successfully

In [ ]:
#creating table 

conn = s.connect('DJ.db')
print ("Opened database successfully")
cur=conn.cursor()

cur.execute('''CREATE TABLE emp1
         (eno INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         SALARY         REAL);''')
print ("Table created successfully");
cur.close()
conn.close()

Opened database successfully
Table created successfully

In [ ]:
# inserting values....
conn = s.connect('DJ.db')
cur =conn.cursor()
cur.execute("INSERT INTO emp1 (eno,NAME,SALARY)VALUES (3, 'P', 20000.00 )")

cur.execute("""INSERT INTO emp1 (eno,NAME,SALARY)
      VALUES (4, 'D', 20000.00 )""")

conn.commit()
print("Records inserted successfully")
cur.close()
conn.close()

Records inserted successfully

In [ ]:
# SELECT Operation....
conn = s.connect('DJ.db')

cursor = conn.execute("SELECT eno, NAME, salary from emp1")
for row in cursor:
   print("eno = ", row[0])
   print("NAME = ", row[1])
   print("SALARY = ", row[2])
   print()

print("Operation done successfully")
conn.close()

eno =  1
NAME =  Pratham
SALARY =  20000.0

eno =  2
NAME =  Dwitiya
SALARY =  20000.0

Operation done successfully

In [ ]:
# update....
conn = s.connect('DJ.db')
print("Opened database successfully")

conn.execute("UPDATE emp1 set SALARY = 55000.00 where eno = 3")
conn.commit()


cursor = conn.execute("SELECT eno, NAME, salary from emp1")
for row in cursor:
   print("eno = ", row[0])
   print("NAME = ", row[1])
   print("SALARY = ", row[2])
   print()

print ("Operation done successfully");
conn.close()

Opened database successfully
eno =  1
NAME =  Pratham
SALARY =  20000.0

eno =  2
NAME =  Dwitiya
SALARY =  20000.0

eno =  3
NAME =  P
SALARY =  55000.0

eno =  4
NAME =  D
SALARY =  20000.0

Operation done successfully

In [ ]:
#Delete...
import sqlite3

conn = sqlite3.connect('DJ.db')
print("Opened database successfully")

conn.execute("DELETE from emp1 where eno = 2;")
conn.commit()

cursor = conn.execute("SELECT eno, NAME, salary from emp1")
for row in cursor:
   print("eno = ", row[0])
   print("NAME = ", row[1])
   print("SALARY = ", row[2])
   print()

print ("Operation done successfully");
conn.close()

Opened database successfully
eno =  1
NAME =  Pratham
SALARY =  20000.0

eno =  3
NAME =  P
SALARY =  55000.0

eno =  4
NAME =  D
SALARY =  20000.0

Operation done successfully